"""
    1. 수평 2칸, 수직 한칸
    2. 수직 2칸, 수평 한칸
    3. 현재위치에서 이동가능한 경우의 수

    알고리즘
    1. 이동가능 -> 8가지
        (-1, 2), (1, 2), (-1, -2), (1, -2), (2, 1), (2, -1), (-2, 1), (-2, -1)
        dx = [-1, 1, -1, 1, 2, 2, -2, -2]
        dy = [2, 2, -2, -2, 1, -1, 1, -1]
    2. 8가지 완전탐색
"""

p = input()
x, y = p[0], p[1]
x = ord(x) - ord('a') + 1
y = int(y)

dx = [-1, 1, -1, 1, 2, 2, -2, -2]
dy = [2, 2, -2, -2, 1, -1, 1, -1]
ans = 0

for i in range(8):
    nx = x + dx[i]
    ny = y + dy[i]

    if nx >= 1 and ny >= 1 and nx <= 8 and ny <= 8:
        ans += 1

print(ans)